/*****************************************************/
/* sam_work_01_01.cpp                                */
/* Лiнiйнi обчислювальнi процеси засобами мови С.    */
/* Дано: r - радiус основи прямого кругового цилiндр.*/
/*       h - висота прямого кругового цилiндра.      */
/* Oбчислити та вивести на друк:                     */
/* sb=2*pi*r*h - площу бiчної поверхнi цилiндра.     */
/* sp=sb+2*pi*r*r - площу повної поверхнi цилiндра.  */
/* v=pi*r*r*h - об'єм цилiндра.                      */
/* Результати розрахункiв подати у виглядi таблицi.  */
/*****************************************************/

#include <iostream>
#include <stdio.h>
#include <conio.h>
#include <math.h>
#include <windows.h>
using namespace std;

int main() {
    system("cls");
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    // Оголошення змiнних:
    float pi = 3.14159; // оголошення pi
    float r;            // радiус основи прямого кругового цилiндра
    float h;            // висота прямого кругового цилiндра
    float sb;           // площа бiчної поверхнi цилiндра
    float sp;           // площа повної поверхнi цилiндра
    float v;            // об'єм цилiндра

    // Ввiд заданих величин:
    printf("Введiть радiус основи цилiндра: ");
    scanf_s("%f", &r);
    printf("Введiть висоту цилiндра: ");
    scanf_s("%f", &h);

    // Обчислення параметрiв цилiндра:
    sb = 2 * pi * r * h;
    sp = sb + 2 * pi * r * r;
    v = pi * r * r * h;

    // Друк результатiв у виглядi таблицi:
    printf("\n Вхiднi величини та результати обчислень:");
    printf("\n I-------------------------------------------I");
    printf("\n I Вхiднi величини:                          I");
    printf("\n I-------------------------------------------I");
    printf("\n I Радiус основи цилiндра I %8.2f I", r);
    printf("\n I-------------------------------------------I");
    printf("\n I Висота цилiндра I %8.2f I", h);
    printf("\n I-------------------------------------------I");
    printf("\n I Результати обчислень:                     I");
    printf("\n I-------------------------------------------I");
    printf("\n I Бiчна поверхня цилiндра I %8.2f I", sb);
    printf("\n I-------------------------------------------I");
    printf("\n I Повна поверхня цилiндра I %8.2f I", sp);
    printf("\n I-------------------------------------------I");
    printf("\n I Об’єм цилiндра I %8.2f I", v);
    printf("\n I-------------------------------------------I\n");

    _getch();
    return 0;
}